FranciscoLlobet/miso2/board/frdmmcxe247/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSPIPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitSPIPins(void)
{
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortE);
    /* Configure digital filter */
    PORT_EnablePinsDigitalFilter(
        /* Digital filter is configured on port B */
        PORTB,
        /* Digital filter is configured for PORTB0 */
        PORT_DFER_DFE_3_MASK,
        /* Disable digital filter */
        false);

    const port_pin_config_t LPSPI0_SIN = {/* Internal pull-up/down resistor is disabled */
                                          kPORT_PullDisable,
                                          /* Passive filter is disabled */
                                          kPORT_PassiveFilterDisable,
                                          /* Low drive strength is configured */
                                          kPORT_LowDriveStrength,
                                          /* Pin is configured as LPSPI0_SIN */
                                          kPORT_MuxAlt3,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          kPORT_UnlockRegister};
    /* PORTB3 (pin 63) is configured as LPSPI0_SIN */
    PORT_SetPinConfig(BOARD_INITSPIPINS_LPSPI0_SIN_PORT, BOARD_INITSPIPINS_LPSPI0_SIN_PIN, &LPSPI0_SIN);
    /* Configure digital filter */
    PORT_EnablePinsDigitalFilter(
        /* Digital filter is configured on port E */
        PORTE,
        /* Digital filter is configured for PORTE0 */
          PORT_DFER_DFE_0_MASK
            /* Digital filter is configured for PORTE1 */
            | PORT_DFER_DFE_2_MASK
            /* Digital filter is configured for PORTE2 */
            | PORT_DFER_DFE_6_MASK,
        /* Disable digital filter */
        false);

    const port_pin_config_t LPSPI0_SCK = {/* Internal pull-up/down resistor is disabled */
                                          kPORT_PullDisable,
                                          /* Passive filter is disabled */
                                          kPORT_PassiveFilterDisable,
                                          /* Low drive strength is configured */
                                          kPORT_LowDriveStrength,
                                          /* Pin is configured as LPSPI0_SCK */
                                          kPORT_MuxAlt2,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          kPORT_UnlockRegister};
    /* PORTE0 (pin 138) is configured as LPSPI0_SCK */
    PORT_SetPinConfig(BOARD_INITSPIPINS_LPSPI0_SCK_PORT, BOARD_INITSPIPINS_LPSPI0_SCK_PIN, &LPSPI0_SCK);

    const port_pin_config_t LPSPI0_SOUT = {/* Internal pull-up/down resistor is disabled */
                                           kPORT_PullDisable,
                                           /* Passive filter is disabled */
                                           kPORT_PassiveFilterDisable,
                                           /* Low drive strength is configured */
                                           kPORT_LowDriveStrength,
                                           /* Pin is configured as LPSPI0_SOUT */
                                           kPORT_MuxAlt2,
                                           /* Pin Control Register fields [15:0] are not locked */
                                           kPORT_UnlockRegister};
    /* PORTE2 (pin 122) is configured as LPSPI0_SOUT */
    PORT_SetPinConfig(BOARD_INITSPIPINS_LPSPI0_SOUT_PORT, BOARD_INITSPIPINS_LPSPI0_SOUT_PIN, &LPSPI0_SOUT);

    const port_pin_config_t LPSPI0_PCS2 = {/* Internal pull-up/down resistor is disabled */
                                           kPORT_PullDisable,
                                           /* Passive filter is disabled */
                                           kPORT_PassiveFilterDisable,
                                           /* Low drive strength is configured */
                                           kPORT_LowDriveStrength,
                                           /* Pin is configured as LPSPI0_PCS2 */
                                           kPORT_MuxAlt2,
                                           /* Pin Control Register fields [15:0] are not locked */
                                           kPORT_UnlockRegister};
    /* PORTE6 (pin 121) is configured as LPSPI0_PCS2 */
    PORT_SetPinConfig(BOARD_INITSPIPINS_LPSPI0_PCS2_PORT, BOARD_INITSPIPINS_LPSPI0_PCS2_PIN, &LPSPI0_PCS2);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitCANPins:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '9', peripheral: CAN0, signal: RX, pin_signal: PTE4/ETM_TRACE_D1/FTM2_QD_PHB/FTM2_CH2/CAN0_RX/FXIO_D6/EWM_OUT_b, identifier: ''}
  - {pin_num: '8', peripheral: CAN0, signal: TX, pin_signal: PTE5/TCLK2/FTM2_QD_PHA/FTM2_CH3/CAN0_TX/FXIO_D7/EWM_IN, identifier: ''}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCANPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitCANPins(void)
{
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortE);

    /* PORTE4 (pin 9) is configured as CAN0_RX */
    PORT_SetPinMux(PORTE, 4U, kPORT_MuxAlt5);

    /* PORTE5 (pin 8) is configured as CAN0_TX */
    PORT_SetPinMux(PORTE, 5U, kPORT_MuxAlt5);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitENET:
- options: {createDeInit: 'true', callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '41', peripheral: ENET, signal: RMII_MDIO, pin_signal: PTB4/FTM0_CH4/LPSPI0_SOUT/MII_RMII_MDIO/TRGMUX_IN1/QSPI_B_IO0, identifier: ''}
  - {pin_num: '39', peripheral: ENET, signal: RMII_MDC, pin_signal: PTE8/FTM0_CH6/MII_RMII_MDC/CMP0_IN3, identifier: ''}
  - {pin_num: '44', peripheral: ENET, signal: RMII_TXD1, pin_signal: PTD7/LPUART2_TX/FTM2_FLT3/MII_RMII_TXD1/ETM_TRACE_D0/QSPI_A_IO1/CMP0_IN6}
  - {pin_num: '47', peripheral: ENET, signal: RMII_TXEN, pin_signal: PTD12/FTM2_CH2/LPI2C1_HREQ/ETM_TRACE_D1/MII_RMII_TX_EN/LPUART2_RTS/QSPI_A_IO2}
  - {pin_num: '52', peripheral: ENET, signal: RMII_RXD0, pin_signal: PTC1/FTM0_CH1/LPSPI2_SOUT/MII_RMII_RXD1/MII_RMII_RXD0/FTM1_CH7/QSPI_B_SCK/ADC0_SE9}
  - {pin_num: '53', peripheral: ENET, signal: RMII_RXD1, pin_signal: PTC0/FTM0_CH0/LPSPI2_SIN/MII_RMII_RXD1/MII_RMII_RXD0/FTM1_CH6/QSPI_B_RWDS/ADC0_SE8}
  - {pin_num: '43', peripheral: ENET, signal: RMII_TXD0, pin_signal: PTC2/FTM0_CH2/CAN0_RX/LPUART0_RX/MII_RMII_TXD0/ETM_TRACE_CLKOUT/QSPI_A_IO3/ADC0_SE10/CMP0_IN5}
  - {pin_num: '56', peripheral: ENET, signal: RMII_CRS_DV, pin_signal: PTC17/FTM1_FLT3/CAN2_TX/LPI2C1_SCLS/MII_RMII_RX_DV/QSPI_B_IO6/ADC0_SE15}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

