FranciscoLlobet/miso2/board/frdmmcxe247/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitENET
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitENET(void)
{
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortE);

    /* PORTB4 (pin 41) is configured as MII_RMII_MDIO */
    PORT_SetPinMux(PORTB, 4U, kPORT_MuxAlt5);

    /* PORTC0 (pin 53) is configured as MII_RMII_RXD1 */
    PORT_SetPinMux(BOARD_INITENET_MII_RMII_RXD_1_PORT, BOARD_INITENET_MII_RMII_RXD_1_PIN, kPORT_MuxAlt4);

    /* PORTC1 (pin 52) is configured as MII_RMII_RXD0 */
    PORT_SetPinMux(BOARD_INITENET_MII_RMII_RXD_0_PORT, BOARD_INITENET_MII_RMII_RXD_0_PIN, kPORT_MuxAlt5);

    /* PORTC17 (pin 56) is configured as MII_RMII_RX_DV */
    PORT_SetPinMux(BOARD_INITENET_MII_RMII_CRS_DV_PORT, BOARD_INITENET_MII_RMII_CRS_DV_PIN, kPORT_MuxAlt5);

    /* PORTC2 (pin 43) is configured as MII_RMII_TXD0 */
    PORT_SetPinMux(BOARD_INITENET_MII_RMII_TXD_0_PORT, BOARD_INITENET_MII_RMII_TXD_0_PIN, kPORT_MuxAlt5);

    /* PORTD12 (pin 47) is configured as MII_RMII_TX_EN */
    PORT_SetPinMux(BOARD_INITENET_MII_RMII_TX_EN_PORT, BOARD_INITENET_MII_RMII_TX_EN_PIN, kPORT_MuxAlt5);

    /* PORTD7 (pin 44) is configured as MII_RMII_TXD1 */
    PORT_SetPinMux(BOARD_INITENET_MII_RMII_TXD_1_PORT, BOARD_INITENET_MII_RMII_TXD_1_PIN, kPORT_MuxAlt5);

    /* PORTE8 (pin 39) is configured as MII_RMII_MDC */
    PORT_SetPinMux(PORTE, 8U, kPORT_MuxAlt5);
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitENET_deinit
 * Description   : This is a de-initialization function for 'BOARD_InitENET' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 * END ****************************************************************************************************************/
void BOARD_InitENET_deinit(void)
{
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortE);
    /* Configure digital filter */
    PORT_EnablePinsDigitalFilter(
        /* Digital filter is configured on port B */
        PORTB,
        /* Digital filter is configured for PORTB0 */
        PORT_DFER_DFE_4_MASK,
        /* Disable digital filter */
        false);

    const port_pin_config_t MII_RMII_MDIO = {/* Internal pull-up/down resistor is disabled */
                                             kPORT_PullDisable,
                                             /* Passive filter is disabled */
                                             kPORT_PassiveFilterDisable,
                                             /* Low drive strength is configured */
                                             kPORT_LowDriveStrength,
                                             /* Pin is disabled */
                                             kPORT_PinDisabledOrAnalog,
                                             /* Pin Control Register fields [15:0] are not locked */
                                             kPORT_UnlockRegister};
    /* PORTB4 (pin 41) is disabled */
    PORT_SetPinConfig(BOARD_INITENET_DEINIT_MII_RMII_MDIO_PORT, BOARD_INITENET_DEINIT_MII_RMII_MDIO_PIN, &MII_RMII_MDIO);
    /* Configure digital filter */
    PORT_EnablePinsDigitalFilter(
        /* Digital filter is configured on port C */
        PORTC,
        /* Digital filter is configured for PORTC0 */
          PORT_DFER_DFE_0_MASK
            /* Digital filter is configured for PORTC1 */
            | PORT_DFER_DFE_1_MASK
            /* Digital filter is configured for PORTC2 */
            | PORT_DFER_DFE_2_MASK
            /* Digital filter is configured for PORTC3 */
            | PORT_DFER_DFE_17_MASK,
        /* Disable digital filter */
        false);

    const port_pin_config_t MII_RMII_RXD_1 = {/* Internal pull-up/down resistor is disabled */
                                              kPORT_PullDisable,
                                              /* Passive filter is disabled */
                                              kPORT_PassiveFilterDisable,
                                              /* Low drive strength is configured */
                                              kPORT_LowDriveStrength,
                                              /* Pin is configured as ADC0_SE8 */
                                              kPORT_PinDisabledOrAnalog,
                                              /* Pin Control Register fields [15:0] are not locked */
                                              kPORT_UnlockRegister};
    /* PORTC0 (pin 53) is configured as ADC0_SE8 */
    PORT_SetPinConfig(BOARD_INITENET_DEINIT_MII_RMII_RXD_1_PORT, BOARD_INITENET_DEINIT_MII_RMII_RXD_1_PIN, &MII_RMII_RXD_1);

    const port_pin_config_t MII_RMII_RXD_0 = {/* Internal pull-up/down resistor is disabled */
                                              kPORT_PullDisable,
                                              /* Passive filter is disabled */
                                              kPORT_PassiveFilterDisable,
                                              /* Low drive strength is configured */
                                              kPORT_LowDriveStrength,
                                              /* Pin is configured as ADC0_SE9 */
                                              kPORT_PinDisabledOrAnalog,
                                              /* Pin Control Register fields [15:0] are not locked */
                                              kPORT_UnlockRegister};
    /* PORTC1 (pin 52) is configured as ADC0_SE9 */
    PORT_SetPinConfig(BOARD_INITENET_DEINIT_MII_RMII_RXD_0_PORT, BOARD_INITENET_DEINIT_MII_RMII_RXD_0_PIN, &MII_RMII_RXD_0);

