FranciscoLlobet/miso2/board/frdmmcxe247/board/pin_mux.c
    const port_pin_config_t MII_RMII_CRS_DV = {/* Internal pull-up/down resistor is disabled */
                                               kPORT_PullDisable,
                                               /* Passive filter is disabled */
                                               kPORT_PassiveFilterDisable,
                                               /* Low drive strength is configured */
                                               kPORT_LowDriveStrength,
                                               /* Pin is configured as ADC0_SE15 */
                                               kPORT_PinDisabledOrAnalog,
                                               /* Pin Control Register fields [15:0] are not locked */
                                               kPORT_UnlockRegister};
    /* PORTC17 (pin 56) is configured as ADC0_SE15 */
    PORT_SetPinConfig(BOARD_INITENET_DEINIT_MII_RMII_CRS_DV_PORT, BOARD_INITENET_DEINIT_MII_RMII_CRS_DV_PIN, &MII_RMII_CRS_DV);

    const port_pin_config_t MII_RMII_TXD_0 = {/* Internal pull-up/down resistor is disabled */
                                              kPORT_PullDisable,
                                              /* Passive filter is disabled */
                                              kPORT_PassiveFilterDisable,
                                              /* Low drive strength is configured */
                                              kPORT_LowDriveStrength,
                                              /* Pin is configured as ADC0_SE10, CMP0_IN5 */
                                              kPORT_PinDisabledOrAnalog,
                                              /* Pin Control Register fields [15:0] are not locked */
                                              kPORT_UnlockRegister};
    /* PORTC2 (pin 43) is configured as ADC0_SE10, CMP0_IN5 */
    PORT_SetPinConfig(BOARD_INITENET_DEINIT_MII_RMII_TXD_0_PORT, BOARD_INITENET_DEINIT_MII_RMII_TXD_0_PIN, &MII_RMII_TXD_0);
    /* Configure digital filter */
    PORT_EnablePinsDigitalFilter(
        /* Digital filter is configured on port D */
        PORTD,
        /* Digital filter is configured for PORTD0 */
          PORT_DFER_DFE_7_MASK
            /* Digital filter is configured for PORTD1 */
            | PORT_DFER_DFE_12_MASK,
        /* Disable digital filter */
        false);

    const port_pin_config_t MII_RMII_TX_EN = {/* Internal pull-up/down resistor is disabled */
                                              kPORT_PullDisable,
                                              /* Passive filter is disabled */
                                              kPORT_PassiveFilterDisable,
                                              /* Low drive strength is configured */
                                              kPORT_LowDriveStrength,
                                              /* Pin is disabled */
                                              kPORT_PinDisabledOrAnalog,
                                              /* Pin Control Register fields [15:0] are not locked */
                                              kPORT_UnlockRegister};
    /* PORTD12 (pin 47) is disabled */
    PORT_SetPinConfig(BOARD_INITENET_DEINIT_MII_RMII_TX_EN_PORT, BOARD_INITENET_DEINIT_MII_RMII_TX_EN_PIN, &MII_RMII_TX_EN);

    const port_pin_config_t MII_RMII_TXD_1 = {/* Internal pull-up/down resistor is disabled */
                                              kPORT_PullDisable,
                                              /* Passive filter is disabled */
                                              kPORT_PassiveFilterDisable,
                                              /* Low drive strength is configured */
                                              kPORT_LowDriveStrength,
                                              /* Pin is configured as CMP0_IN6 */
                                              kPORT_PinDisabledOrAnalog,
                                              /* Pin Control Register fields [15:0] are not locked */
                                              kPORT_UnlockRegister};
    /* PORTD7 (pin 44) is configured as CMP0_IN6 */
    PORT_SetPinConfig(BOARD_INITENET_DEINIT_MII_RMII_TXD_1_PORT, BOARD_INITENET_DEINIT_MII_RMII_TXD_1_PIN, &MII_RMII_TXD_1);
    /* Configure digital filter */
    PORT_EnablePinsDigitalFilter(
        /* Digital filter is configured on port E */
        PORTE,
        /* Digital filter is configured for PORTE0 */
        PORT_DFER_DFE_8_MASK,
        /* Disable digital filter */
        false);

    const port_pin_config_t MII_RMII_MDC = {/* Internal pull-up/down resistor is disabled */
                                            kPORT_PullDisable,
                                            /* Passive filter is disabled */
                                            kPORT_PassiveFilterDisable,
                                            /* Low drive strength is configured */
                                            kPORT_LowDriveStrength,
                                            /* Pin is configured as CMP0_IN3 */
                                            kPORT_PinDisabledOrAnalog,
                                            /* Pin Control Register fields [15:0] are not locked */
                                            kPORT_UnlockRegister};
    /* PORTE8 (pin 39) is configured as CMP0_IN3 */
    PORT_SetPinConfig(BOARD_INITENET_DEINIT_MII_RMII_MDC_PORT, BOARD_INITENET_DEINIT_MII_RMII_MDC_PIN, &MII_RMII_MDC);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
